ГТС/УТГТС/DataProcessors/ОперацииЗакрытияМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОперацииЗакрытияМесяца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивОрганизаций</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииРегламентный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииРегламентныйМУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьсяПоОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЭтапыСоСтатусомНеТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЭтапыСоСтатусомВыполненоУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьПоясненияКЭтапам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтообновлениеПриЗакрытииПодчиненныхФорм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗакрытияМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыЗакрытияМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредварительногоЗакрытияМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/НастройкаБлокировкиОтИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаБлокировкиОтИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаблокироватьПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ОперацииЗакрытияМесяца/Forms/ВыборОрганизаций/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации 	= НачалоМесяца(Параметры.ПериодРегистрации);
	ОписаниеОрганизаций = Параметры.ОписаниеОрганизаций;
	
	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) ИЛИ НЕ ЗначениеЗаполнено(ОписаниеОрганизаций) Тогда
		ВызватьИсключение НСтр("ru='Некорректный контекст открытия формы'");
	КонецЕсли;
	
	ЗаполнитьДеревоОрганизаций();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОрганизации(Команда)
	
	МассивОрганизаций = Новый Массив;
	ВсеОрганизации = Истина;
	
	Для Каждого ТекущаяОрганизация Из ДеревоОрганизаций.ПолучитьЭлементы() Цикл
		
		Если НЕ ТекущаяОрганизация.Отметка Тогда
			ВсеОрганизации = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОрганизация.ЭтоГруппа Тогда
			
			Для Каждого ТекущаяОрганизация2 Из ТекущаяОрганизация.ПолучитьЭлементы() Цикл
				МассивОрганизаций.Добавить(ТекущаяОрганизация2.Организация);
			КонецЦикла;
			
		Иначе
			МассивОрганизаций.Добавить(ТекущаяОрганизация.Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивОрганизаций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо выбрать организации для закрытия месяца.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	Если ВсеОрганизации Тогда
		МассивОрганизаций.Очистить();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивОрганизаций", МассивОрганизаций);
	Результат.Вставить("ВсеОрганизации", 	ВсеОрганизации);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	СинхронизироватьОтметкиПодчиненныхЭлементов(ДеревоОрганизаций, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	СинхронизироватьОтметкиПодчиненныхЭлементов(ДеревоОрганизаций, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоОрганизацийОтметкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоОрганизаций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизироватьОтметкиПодчиненныхЭлементов(ТекущиеДанные, ТекущиеДанные.Отметка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДеревоОрганизацийОрганизация Тогда
		
		СтрокаОрганизации = ДеревоОрганизаций.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		Если СтрокаОрганизации <> Неопределено
		 И ТипЗнч(СтрокаОрганизации.Организация) = Тип("СправочникСсылка.Организации") Тогда
			ПоказатьЗначение(, СтрокаОрганизации.Организация);
	 	КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоОрганизаций()
	
	МассивОрганизаций 	= Параметры.МассивОрганизаций;
	ВсеОрганизации 		= Параметры.ВсеОрганизации;
	
	ДатыБлокировки = РегистрыСведений.НастройкаБлокировкиОтИзменений.ДатыБлокировкиПоОрганизациям(ОписаниеОрганизаций.ДоступныеОрганизации);
	
	ДеревоОрганизаций.ПолучитьЭлементы().Очистить();
	
	// Заполним "одиночные" организации.
	Для Каждого ТекущаяОрганизация Из ОписаниеОрганизаций.ОдиночныеОрганизации Цикл
		
		Если ОписаниеОрганизаций.ДоступныеОрганизации.Найти(ТекущаяОрганизация) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаПоОрганизации = ДатыБлокировки.Получить(ТекущаяОрганизация);
		
		НоваяСтрока = ДеревоОрганизаций.ПолучитьЭлементы().Добавить();
		
		НоваяСтрока.Организация			= ТекущаяОрганизация;
		НоваяСтрока.Отметка				= ВсеОрганизации ИЛИ МассивОрганизаций.Найти(ТекущаяОрганизация) <> Неопределено;
		НоваяСтрока.ИзменениеОтметки	= Истина;
		НоваяСтрока.Заблокирована		= (ПериодРегистрации <= ДатаПоОрганизации);
		
		Если НоваяСтрока.Заблокирована Тогда
			НоваяСтрока.ИнформацияОБлокировке = " " + НСтр("ru='установлена блокировка по'") + " "
				+ ЗакрытиеМесяцаКлиентСервер.ПредставлениеПериодаМесяцГод(ДатаПоОрганизации);
		КонецЕсли;
		
		ЕстьЗаблокированные = ЕстьЗаблокированные ИЛИ НоваяСтрока.Заблокирована;
		
	КонецЦикла;
	
	// Заполним группы организаций.
	КоличествоГрупп = 0;
	
	Для Каждого ТекущаяГруппа Из ОписаниеОрганизаций.ГруппыОрганизаций Цикл
		
		НоваяГруппа = ДеревоОрганизаций.ПолучитьЭлементы().Добавить();
		
		ЕстьИнтеркампани = Ложь;
		ЕстьОСиНМА       = Ложь;
		ЕстьНедоступные  = Ложь;
		ЕстьОтмеченные   = Ложь;
		ЕстьНеотмеченные = Ложь;
		ЕстьЗаблокированныеВГруппе = Ложь;
		ДатаПоГруппе = ДобавитьМесяц(ПериодРегистрации, 1);
		
		Для Каждого ТекущаяОрганизация Из ТекущаяГруппа Цикл
			
			Если ОписаниеОрганизаций.ДоступныеОрганизации.Найти(ТекущаяОрганизация) = Неопределено Тогда
				ЕстьНедоступные = Истина;
				Продолжить;
			КонецЕсли;
			
			ДатаПоОрганизации = ДатыБлокировки.Получить(ТекущаяОрганизация);
			
			НоваяСтрока = НоваяГруппа.ПолучитьЭлементы().Добавить();
			
			НоваяСтрока.Организация			= ТекущаяОрганизация;
			НоваяСтрока.Отметка				= ВсеОрганизации ИЛИ МассивОрганизаций.Найти(ТекущаяОрганизация) <> Неопределено;
			НоваяСтрока.ИзменениеОтметки	= Ложь;
			НоваяСтрока.Заблокирована		= (ПериодРегистрации <= ДатаПоОрганизации);
			
			Если НоваяСтрока.Заблокирована Тогда
				
				НоваяСтрока.ИнформацияОБлокировке = " " + НСтр("ru='установлена блокировка по'") + " "
					+ ЗакрытиеМесяцаКлиентСервер.ПредставлениеПериодаМесяцГод(ДатаПоОрганизации);
					
				ЕстьЗаблокированныеВГруппе = Истина;
				ДатаПоГруппе = Макс(ДатаПоГруппе, ДатаПоОрганизации);
				
				НоваяГруппа.Заблокирована = Истина;
				НоваяГруппа.ИнформацияОБлокировке = " " + НСтр("ru='установлена блокировка по'") + " "
					+ ЗакрытиеМесяцаКлиентСервер.ПредставлениеПериодаМесяцГод(ДатаПоГруппе);
					
			КонецЕсли;
			
			ЕстьЗаблокированные = ЕстьЗаблокированные ИЛИ НоваяСтрока.Заблокирована;
			
			ОрганизацииИнтеркампани = ОписаниеОрганизаций.ОрганизацииИнтеркампани; // Соответствие
			ОрганизацииОСиНМА = ОписаниеОрганизаций.ОрганизацииОСиНМА; // Соответствие
			
			ЕстьИнтеркампани = ЕстьИнтеркампани ИЛИ ОрганизацииИнтеркампани.Получить(ТекущаяОрганизация) <> Неопределено;
			ЕстьОСиНМА 		 = ЕстьОСиНМА ИЛИ ОрганизацииОСиНМА.Получить(ТекущаяОрганизация) <> Неопределено;
			
			ЕстьОтмеченные   = ЕстьОтмеченные ИЛИ НоваяСтрока.Отметка;
			ЕстьНеотмеченные = ЕстьНеотмеченные ИЛИ НЕ НоваяСтрока.Отметка;
			
		КонецЦикла;
		
		Если НоваяГруппа.ПолучитьЭлементы().Количество() = 0 Тогда
			// В группе нет доступных организаций
			ДеревоОрганизаций.ПолучитьЭлементы().Удалить(НоваяГруппа);
			Продолжить;
			
		ИначеЕсли ЕстьЗаблокированныеВГруппе Тогда
			
			Для Каждого СтрокаГруппы Из НоваяГруппа.ПолучитьЭлементы() Цикл
				
				Если НЕ СтрокаГруппы.Заблокирована Тогда
					
					СтрокаГруппы.Заблокирована = Истина;
					СтрокаГруппы.ИнформацияОБлокировке = " " + НСтр("ru='есть заблокированные в этой группе'");
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		КоличествоГрупп = КоличествоГрупп + 1;
		НаименованиеГруппы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Группа организаций №%1: %2%3%4%5'", ОбщегоНазначения.КодОсновногоЯзыка()),
			СокрЛП(КоличествоГрупп),
			?(ЕстьИнтеркампани, """" + Обработки.ОперацииЗакрытияМесяца.НазваниеГруппыОрганизацийИнтеркампани() + """", ""),
			?(ЕстьИнтеркампани И ЕстьОСиНМА, " " + НСтр("ru='и'", ОбщегоНазначения.КодОсновногоЯзыка()) + " ", ""),
			?(ЕстьОСиНМА, """" + Обработки.ОперацииЗакрытияМесяца.НазваниеГруппыОрганизацийОСиНМА() + """", ""),
			?(ЕстьНедоступные, " (" + НСтр("ru='нет прав на все организации группы'", ОбщегоНазначения.КодОсновногоЯзыка()) + ")", ""));
			
		НоваяГруппа.Организация 	 = СокрЛП(НаименованиеГруппы);
		НоваяГруппа.ЭтоГруппа 		 = Истина;
		НоваяГруппа.Отметка 		 = ЕстьОтмеченные;
		НоваяГруппа.ИзменениеОтметки = Истина;
		НоваяГруппа.ЕстьНедоступные  = ЕстьНедоступные;
		
		Если ЕстьОтмеченные И ЕстьНеотмеченные Тогда
			
			Для Каждого ТекущаяОрганизация Из НоваяГруппа.ПолучитьЭлементы() Цикл
				ТекущаяОрганизация.Отметка = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ДекорацияПредупреждениеОБлокировке.Видимость = ЕстьЗаблокированные;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьОтметкиПодчиненныхЭлементов(ЭлементДерева, Отметка)
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементДерева.ПолучитьЭлементы() Цикл
		
		ПодчиненныйЭлемент.Отметка = Отметка;
		
		Если ПодчиненныйЭлемент.ЭтоГруппа Тогда
			СинхронизироватьОтметкиПодчиненныхЭлементов(ПодчиненныйЭлемент, Отметка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Запрет выбора отдельных организаций в группах.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОрганизацийОтметка.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОрганизаций.ИзменениеОтметки");
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Выделение группы организаций.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОрганизацийОтметка.Имя);
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОрганизацийОрганизация.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОрганизаций.ЭтоГруппа");
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Элементы.ДеревоОрганизацийОрганизация.Шрифт, , , Истина));
	
	// Выделение заблокированных организаций.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОрганизацийОтметка.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОрганизаций.Заблокирована");
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоОрганизацийОтметка.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоОрганизаций.Заблокирована");
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

#КонецОбласти
